[
        {
            "name": "Web Development Bachelors degree",
            "location": "Cork Institute of Technology",
            "desc": "I did a 4 year degree in web development, as part of this course I learned how to use the various Web Development technologies, both front end and back end, as well as a bit of programming and database management.",
            "start_date": "2015",
            "end_date": "2019",
            "duration": "4 years"
        },
        {
            "name": "Software Engineer",
            "location": "McAfee Cork",
            "desc": "I worked at McAFee as a Software Engineer, on a team called 'Endpoint performance' and most of my work was relevant to QA testing new versions of the Anti Virus software on windows machines. \\n My primary responsibility involved testing automation, I created and deployed images for testing and set up testing servers. I Developed a JavaScript application that enabled the automated configuration of testing images through the use JSON config files detailing information about the desired software stack as well as client details associated with the testing environment.",
            "start_date": "01/2018",
            "end_date": "09/2018",
            "duration": "9 months"
        },
        {
            "name": "Freelance Software Development",
            "location": "UK",
            "desc": "My first major contract was in early 2020, I implemented a series of features primarily related to datamanagement into an application for managing clinics on a platform made up of JS, a proprietary PHPframework as well as doing various tasks with a MariaDB database handling various sensitive data. My second major contract was during summer, I worked on finishing a web application for warehousemanagement, on a platform made from vanilla PHP, Bootstrap, Jquery as well as a MySQL database. Mycontribution was primarily working with various methods of data management and interacting with RESTfulAPIs. I've also worked on a few smaller freelance project, most notably a Python application using Spark forparsing data efficiently, a RESTful API in Node.js and a custom Java application for sending and retrievingfiles from a server through sockets, as well as some other minor projects.",
            "start_date": "12/2019",
            "end_date": "(ongoing)",
            "duration": "4 months"
        }
    ]
