{
    "web_dev":[
       {
          "name":"HTML5, CSS3, JS",
          "desc":"I have pretty extensive experience going back around 7 years, the time when I first started dabbling in Web Development. I started seriously getting into it back in 2015 when I began my Web Development BSC degree",
          "exp": "9/10",
          "desc2": "With around 6 years of experience I am pretty well versed with this technology, anything new here would be pretty easy to learn.",
          "icon":"icons/x3.png"
       },
       {
          "name":"Node.js",
          "desc":"My experience with node is good, I first began using it around 2017 as a backend alternative to PHP. I am personally a big fan of node, as I enjoy writing in JS, and Node makes JS a far more powerful language.",
          "exp": "8/10",
          "desc2": "I am pretty good at using Node and have used it to great effect, I find new libraries and such pretty straightforward to learn",
          "icon":"icons/nodejs.png"
       },
       {
          "name":"PHP",
          "desc":"My level of PHP experience is similar to JS, I find the two languages to be pretty similar in nature. ",
          "exp": "7/10",
          "desc2": "I have worked with it as part of the LAMP/WAMP stack, and ive also used them in both Drupal and Wordpress",
          "icon":"icons/php.png"
       },
       {
          "name":"Vue.js",
          "desc":"I have decent experience with Vue, It is my framework of choice due to its light weight nature, a nice learning curve and a ton of really fascinating functionality. You may or may not have noticed, but this site was built using Vue.",
          "exp": "7/10",
          "desc2": "I would describe my experience with vue to be about intermediate, I have created multiple websites with it and im proficient enough with it to get things done.",
          "icon":"icons/vue.png"
       },
       {
          "name":"JQuery",
          "desc":"JQuery is what I used to almost always include in my websites and web applications, and I still do from time to time when im creating something small. I like the added functionality and the simplification of certain tasks that JQuery brings with it.",
          "exp": "8/10",
          "desc2": "I am pretty experienced with JQuery, I generally find no issue using it for any task I have.",
          "icon":"icons/jquery2.png"
       },
       {
          "name":"D3",
          "desc":"D3 is an incredibly powerful library for JavaScript while also having a relatively straightforward learning curve. It was actually a big part of my thesis project, I used it for my web based multiplayer game that ive made.",
          "exp": "7/10",
          "desc2": "I am proficient with D3, its a pretty straightforward piece of technology.",
          "icon":"icons/d3.png"
       }
    ],
    "soft_dev":[
       {
          "name":"JavaScript",
          "desc":"Ive been using JS for a pretty long time, and it was the main programming language ive used when in University doing my degree. Ive mentioned it in the Web development section, but im adding it here as well, as it can be used for many things that arent neccesarily Web Dev related.",
          "exp": "9/10",
          "desc2": "I am very proficient in Vanilla JavaScript, and any new libraries or other such things are generally pretty easy for me to learn.",
          "icon":"icons/js.png"
       },
       {
          "name":"Java",
          "desc":"Ive been writing in Java for most of my degree as well as during my internship, and ive reached a relatively decent level of knowledge, ive done Object Oriented Java programming and used technologies such as JavaFX to make GUIs as well as Sockets and RMI for web services.",
          "exp": "7/10",
          "desc2": "My experience with Java is pretty decent, after JavaScript its the first programming language ive learned. Im planning to learn Spring in the future to expand my skills.",
          "icon":"icons/java.png"
       },
       {
          "name":"Python",
          "desc":"Ive used Python for about two years for tasks such as security testing, back end development and big data management technologies like Spark",
          "exp": "6/10",
          "desc2": "I have not used Python as much as I have the previous two languages, however compared to them, I find Python to be rather easy and I would like to learn it more.",
          "icon":"icons/snek.png"
       },
       {
          "name":"C++",
          "desc":"Im pretty new to C++, as im just beginning to learn it, as it wasnt part of my degree, I plan on using EDX to do online courses and learn it.",
          "exp": "3/10",
          "desc2": "Im inexperienced with C++, however I think learning it further wont be too difficult, I find it to be somewhat similar to Java.",
          "icon":"icons/c++.png"
       },
       {
         "name":"DBMS",
         "desc":"I have a lot of experience with a wide range of DBMS technologies, such as MySQL, SQLite, MSSQL, Ingress, MariaDB, Firebase",
         "exp": "7/10",
         "desc2": "My DBMS of choice would generally be SQLite due to its ease of use, lightweight design and ability to embed it into an application. However ive also used a good bit of both MySQL and MSSQL.",
         "icon":"icons/db.png"
      }
    ],
    "dbms":[],
    "other":[
      {
         "name":"Hardware",
         "desc":"I have a very extensive level of knowledge when it comes to computer hardware, ive been interested in computers as long as I can remember, and I can assemble and disassemble computers with ease.",
         "exp": "",
         "desc2": "This allows me to personally do tasks such as diagnosis, repair and upgrades. The PC I currently use is something ive built myself.",
         "icon":"icons/devman.jpeg"
      },
      {
         "name":"Photoshop",
         "desc":"I am pretty competent with photoshop and general picture editing, its something ive been doing as a hobby for about a decade now.",
         "exp": "",
         "desc2": "The few pictures you can see on this site have all been taken and edited by me.",
         "icon":"icons/ps.png"
      },
      {
         "name":"linux",
         "desc":"Ive been using various linux distros for a few years, this includes primarily Ubuntu which I currently have installed on my laptop and pc in dual boot as well as Linux Mint and Arch Linux.",
         "exp": "",
         "desc2": "This has also given me a pretty good knowledge of bash, writing various scripts or even just commands, which are an integral part of linux usage.",
         "icon":"icons/linux.png"
      },
      {
         "name":"Cloud hosting",
         "desc":"I have a bit of experience with cloud hosting, primarily using Heroku, a platform ive used to host my application Dice Doge.",
         "exp": "",
         "desc2": "Ive also touched other platforms such as Google cloud, and im currently learning a bit about AWS.",
         "icon":"icons/heroku.png"
      },
      {
         "name":"Premiere",
         "desc":"other item desc here",
         "exp": "",
         "desc2": "",
         "icon":"icons/premiere.png"
      }
    ]
 }